app/controllers/blogs_controller.rb

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
   @country = Country.find(params[:country_id])