app/controllers/blogs_controller.rb

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
   @country = Country.find(params[:country_id])
   @blogs = Blog.find(params[:id])

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 227], ["LIMIT", 1]]
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "country_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "blog"], ["body", "blog"], ["created_at", "2019-04-11 16:47:28.225564"], ["updated_at", "2019-04-11 16:47:28.225564"], ["country_id", 227]]
---
 def create
   @country = Country.find(params[:country_id])
   @blog = Blog.new(blog_params)
   if @blog.save

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 154], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 11]]
---
 def destroy
   @country = Country.find(params[:country_id])
   @blog = Blog.find(params[:id])
   @blog.destroy