app/controllers/comments_controller.rb

  def show
    @country = Country.find(params[:country_id])
    @comment = Comment.find(params[:id])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 227], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @country= Country.find(params[:country_id])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @country = Country.find(params[:country_id])
    @comment = Comment.new(comment_params)
    if @comment.save
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO "comments" ("fave_food", "fave_city", "fave_site", "would_revisit", "biggest_surprise", "created_at", "updated_at", "country_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @comment = Comment.find(params[:id])
    @country = Country.find(params[:country_id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 154], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]