app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "danthomp507@gmail.com"], ["LIMIT", 1]]
---
  def login
    email = params[:email]
    password = params[:password]

    user = User.find_from_credentials email, password