app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "username", "password_digest", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "bio" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "dannythomp"], ["bio", "this is one more update "], ["updated_at", "2019-04-09 21:39:10.753975"], ["id", 9]]