app/models/user.rb

  def self.find_from_credentials(email, password)
    user = self.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "danthomp507@gmail.com"], ["LIMIT", 1]]